cfdSimulation/NASAsc2-0410_rhoSimpleFoam/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication surfaceFeatureExtract

runApplication decomposePar

runApplication mpirun -np 4 --oversubscribe snappyHexMesh -parallel -overwrite

#------------------------------------------------------------------------------
